prologue = [
    "أنت موظف تقضي معظم أيامك بين العمل والالتزامات والزحمة، لكن لديك هواية تعتبرها مهرب عن ضغوط الحياة، وتحرص دايم على تخصيص وقت لها وهي التصوير الفلكي.",

    "لك أسابيع وأنت تخطط لالتقاط صور لزخة شهب منتظرة، ودك توثيقها بأفضل سطوع وكثرة",

    "درست وحددت أفضل وقت وموقع لتصوريها يتناسب مع ارتباطاتك ودوامك، وجاء الاختيار على يوم الخميس الساعة تسعة -الي صادف انه اخر يوم لرؤية هذي الزخة- في منطقة في البر",

    "مرت الأيام وجاء الخميس توك راجع من الشغل وخارج من الزحمة منهك تماما فقررت تخذ غفوة قصيرة قبل تروح...",

    "... وفجأة تستيقظ والساعة ٨:٠٠!! الموقع بعيد، ومعداتك يبي لها تجهيز، ولم يتبقَّ سوى ساعة على الموعد الذي حددته وعشان تصور الصورة المثالية لازم توصل وتركيب معداتك وتجهيز الكاميرا قبل الساعة 9:00.",

    "تأخذ نفسًا عميقًا، تنظر إلى معداتك... حان وقت الانطلاق."
]


tire_event = {
    "text": "تركب على عجل السيارة بس عندك إحساس إنك نسيت حاجة:",

    "choices": {
        "A": "تسمع لإحساسك وتشيك",
        "B": "تتجاهله وتوفر وقت أصلا دايم تحس كذا ويطلع ما في شيء"
    }
}

tire_checked = "شيكت على السيارة وتذكرت إنك ما نسمت الكفر"


road_event = {
    "text": "توصل لمفترق طرق، طريق ممهد بس طويل وطريق غير ممهد بس قصير:",

    "choices": {
        "A": "تلعب بالمضمون وتخذ الطريق ممهد",
        "B": "تخاطر وتأخذ الطريق غير ممهد"
    }
}

paved_result = "مع انه الطريق أطول بس كان سلس وما واجهتك أي مشاكل."

unpaved_aired_result = (
    "يا الله! غرزت بس الحمدالله أنك نسمت قبل وخرجت لك السيارة بسرعة"
)

unpaved_not_aired_result = (
    "يا الله! غرزت حاولت تخرج بس ما قدرت ايش تسوي:"
)

stuck_event = {
    "choices": {
        "A": "تحاول أكثر",
        "B": "تنتظر شخص يمر ويساعدك"
    }
}

stuck_try_result = (
    "ما قدرت تخرجها واضطريت تنتظر أحد راح بنزين على الفاضي"
)

help_result = (
    "يمر عليك شخص ويساعدك وينصحك المرة الجايه تنسم الكفر قبل تخرج "
    "تشكره وتكمل طريقك"
)

person_event = {
    "text": "خلاص ما باقي لك شيء وتوصل بس تشوف شخص واقف في الطريق يحتاج توصيله:",

    "choices": {
        "A": "توصله",
        "B": "لاحظت وراك سيارات جايه غالبا بساعدونه وانت مستعجل لذا قررت تكمل"
    }
}

person_helped_result = (
    "توصله ويدعي لك بالتوفيق والبركة وفعلا حسيت الوقت صار فيه بركة"
)


# ENDINGS
endings = {
    "best": (
        "توصل إلى موقع التصوير أخيرًا.\n\n"
        "تلحق تجهز معداتك بهدوء، وتلتقط صورة أفضل حتى من الصورة التي كنت تتخيلها"
        "وبعد فترة، تُختار صورتك لتكون صورة الشهر في موقع هيئة الفضاء السعودية"
    ),

    "good": (
        "توصل إلى موقع التصوير أخيرًا.\n\n"
        "تستعجل في تجهيز معداتك وتلتقط صورة جيدة، لكنها ليست بالصورة التي كنت تتخيلها"
    ),

    "late": (
        "توصل إلى موقع التصوير أخيرًا.\n\n"
        "تصل متأخرًا، ولم تعد تملك وقتًا كافيًا لالتقاط الصورة التي خططت لها. "
        "تلتقط صورة أقل من المستوى الذي كنت تطمح إليه، لكنك تجلس قليلًا وتتأمل السماء الصافية... "
        "وعلى الأقل، استمتعت بمنظر النجوم"
    )
}
